Revit 2027 API
AppearanceAssetElement.SetRenderingAsset Method
 Sets the rendering asset for the appearance asset element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRenderingAsset(
	Asset asset
)
Public Sub SetRenderingAsset (
	asset As Asset
)
public:
void SetRenderingAsset(
	Asset^ asset
)
member SetRenderingAsset :
        asset : Asset -> unit
Parameters
asset Asset
 The new rendering asset. It should be an appearance asset.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The asset is not an appearance asset.
See Also
Reference
AppearanceAssetElement Class
Autodesk.Revit.DB Namespace